### 📖 Terraform Plan (src/common/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.application_gateway_itn.azurerm_web_application_firewall_policy.agw will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "agw" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-waf-01"
        name                = "io-p-itn-agw-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_itn.azurerm_web_application_firewall_policy.app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-itn-agw-api-app-waf-01"
        name                = "io-p-itn-agw-api-app-waf-01"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.application_gateway_weu.azurerm_web_application_firewall_policy.api_app will be updated in-place
  ~ resource "azurerm_web_application_firewall_policy" "api_app" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/io-p-waf-appgateway-api-app-policy"
        name                = "io-p-waf-appgateway-api-app-policy"
        tags                = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (4 unchanged attributes hidden)

      ~ policy_settings {
          ~ request_body_enforcement                  = false -> true
          ~ request_body_inspect_limit_in_kb          = 0 -> 128
            # (7 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_custom_domain.assets will be created
  + resource "azurerm_cdn_frontdoor_custom_domain" "assets" {
      + cdn_frontdoor_profile_id = (known after apply)
      + expiration_date          = (known after apply)
      + host_name                = "assets.io.pagopa.it"
      + id                       = (known after apply)
      + name                     = "assets-io-pagopa-it"
      + validation_token         = (known after apply)

      + tls {
          + cdn_frontdoor_secret_id = (known after apply)
          + certificate_type        = "ManagedCertificate"
          + minimum_tls_version     = "TLS12"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_endpoint.cdn_endpoint will be created
  + resource "azurerm_cdn_frontdoor_endpoint" "cdn_endpoint" {
      + cdn_frontdoor_profile_id = (known after apply)
      + enabled                  = true
      + host_name                = (known after apply)
      + id                       = (known after apply)
      + name                     = "io-p-itn-assets-cdn-endpoint"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_origin.primary_origin will be created
  + resource "azurerm_cdn_frontdoor_origin" "primary_origin" {
      + cdn_frontdoor_origin_group_id  = (known after apply)
      + certificate_name_check_enabled = false
      + enabled                        = true
      + host_name                      = (known after apply)
      + http_port                      = 80
      + https_port                     = 443
      + id                             = (known after apply)
      + name                           = "primary-origin"
      + origin_host_header             = (known after apply)
      + priority                       = 1
      + weight                         = 1
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_origin_group.primary_origin_group will be created
  + resource "azurerm_cdn_frontdoor_origin_group" "primary_origin_group" {
      + cdn_frontdoor_profile_id                                  = (known after apply)
      + id                                                        = (known after apply)
      + name                                                      = "primary-origin-group"
      + restore_traffic_time_to_healed_or_new_endpoint_in_minutes = 10
      + session_affinity_enabled                                  = false

      + load_balancing {
          + additional_latency_in_milliseconds = 0
          + sample_size                        = 16
          + successful_samples_required        = 3
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_profile.cdn_profile will be created
  + resource "azurerm_cdn_frontdoor_profile" "cdn_profile" {
      + id                       = (known after apply)
      + name                     = "io-p-itn-assets-cdnp-01"
      + resource_group_name      = "io-p-itn-assets-cdn-rg-01"
      + resource_guid            = (known after apply)
      + response_timeout_seconds = 120
      + sku_name                 = "Standard_AzureFrontDoor"
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["abi_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/logos/abi"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "abi-logos-route"
      + patterns_to_match             = [
          + "/logos/abi/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["app_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/logos/apps"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "app-logos-route"
      + patterns_to_match             = [
          + "/logos/apps/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["assistance_tools"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/assistanceTools"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "assistance-tools-route"
      + patterns_to_match             = [
          + "/assistanceTools/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["bonus"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/bonus"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "bonus-route"
      + patterns_to_match             = [
          + "/bonus/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["contextualhelp"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/contextualhelp"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "contextualhelp-route"
      + patterns_to_match             = [
          + "/contextualhelp/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["email_assets"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/email-assets"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "email-assets-route"
      + patterns_to_match             = [
          + "/email-assets/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["eucovidcert_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/logos/eucovidcert"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "eucovidcert-logos-route"
      + patterns_to_match             = [
          + "/logos/eucovidcert/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["html"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/html"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "html-route"
      + patterns_to_match             = [
          + "/html/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["locales"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/locales"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "locales-route"
      + patterns_to_match             = [
          + "/locales/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["municipalities"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/municipalities"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "municipalities-route"
      + patterns_to_match             = [
          + "/municipalities/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["organization_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/services"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "organization-logos-route"
      + patterns_to_match             = [
          + "/logos/organizations/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["privative_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/logos/privative"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "privative-logos-route"
      + patterns_to_match             = [
          + "/logos/privative/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["service_logos"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/services"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "service-logos-route"
      + patterns_to_match             = [
          + "/logos/services/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["services_webview"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/services/services-webview"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "services-webview-route"
      + patterns_to_match             = [
          + "/services-webview/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["sign"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/sign"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "sign-route"
      + patterns_to_match             = [
          + "/sign/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_route.static_routes["spid_idps"] will be created
  + resource "azurerm_cdn_frontdoor_route" "static_routes" {
      + cdn_frontdoor_endpoint_id     = (known after apply)
      + cdn_frontdoor_origin_group_id = (known after apply)
      + cdn_frontdoor_origin_ids      = (known after apply)
      + cdn_frontdoor_origin_path     = "/spid/idps"
      + cdn_frontdoor_rule_set_ids    = (known after apply)
      + enabled                       = true
      + forwarding_protocol           = "MatchRequest"
      + https_redirect_enabled        = true
      + id                            = (known after apply)
      + link_to_default_domain        = true
      + name                          = "spid-idps-route"
      + patterns_to_match             = [
          + "/spid/idps/*",
        ]
      + supported_protocols           = [
          + "Http",
          + "Https",
        ]
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.assistancetoolszendesk will be created
  + resource "azurerm_cdn_frontdoor_rule" "assistancetoolszendesk" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "assistancetoolszendesk"
      + order                       = 5

      + actions {
          + route_configuration_override_action {
              + cache_behavior = "OverrideAlways"
              + cache_duration = "00:05:00"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/assistanceTools/zendesk.json",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.bonus will be created
  + resource "azurerm_cdn_frontdoor_rule" "bonus" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "bonus"
      + order                       = 3

      + actions {
          + route_configuration_override_action {
              + cache_behavior = "OverrideAlways"
              + cache_duration = "00:15:00"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/bonus",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.global_cache will be created
  + resource "azurerm_cdn_frontdoor_rule" "global_cache" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "globalcache"
      + order                       = 1

      + actions {
          + route_configuration_override_action {
              + cache_behavior = "OverrideAlways"
              + cache_duration = "08:00:00"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "*",
                ]
              + negate_condition = false
              + operator         = "Any"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.servicesdata will be created
  + resource "azurerm_cdn_frontdoor_rule" "servicesdata" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "servicesdata"
      + order                       = 2

      + actions {
          + route_configuration_override_action {
              + cache_behavior = "OverrideAlways"
              + cache_duration = "00:15:00"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/services-data",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.sign will be created
  + resource "azurerm_cdn_frontdoor_rule" "sign" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "sign"
      + order                       = 6

      + actions {
          + response_header_action {
              + header_action = "Append"
              + header_name   = "Access-Control-Allow-Origin"
              + value         = "*"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/sign",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
              + transforms       = [
                  + "Lowercase",
                ]
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule.status will be created
  + resource "azurerm_cdn_frontdoor_rule" "status" {
      + behavior_on_match           = "Continue"
      + cdn_frontdoor_rule_set_id   = (known after apply)
      + cdn_frontdoor_rule_set_name = (known after apply)
      + id                          = (known after apply)
      + name                        = "status"
      + order                       = 4

      + actions {
          + route_configuration_override_action {
              + cache_behavior = "OverrideAlways"
              + cache_duration = "00:05:00"
            }
        }

      + conditions {
          + request_uri_condition {
              + match_values     = [
                  + "/status",
                ]
              + negate_condition = false
              + operator         = "BeginsWith"
            }
        }
    }

  # module.assets_locales_cdn.azurerm_cdn_frontdoor_rule_set.primary_ruleset will be created
  + resource "azurerm_cdn_frontdoor_rule_set" "primary_ruleset" {
      + cdn_frontdoor_profile_id = (known after apply)
      + id                       = (known after apply)
      + name                     = "primaryruleset"
    }

  # module.assets_locales_cdn.azurerm_dns_cname_record.assets_io_pagopa_it will be created
  + resource "azurerm_dns_cname_record" "assets_io_pagopa_it" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "assets"
      + record              = (known after apply)
      + resource_group_name = "io-p-itn-external-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + ttl                 = 3600
      + zone_name           = "io.pagopa.it"
    }

  # module.assets_locales_cdn.module.cdn_storage.azurerm_monitor_metric_alert.storage_account_health_check[0] will be created
  + resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      + auto_mitigate            = false
      + description              = "The average availability is less than 99.8%. Runbook: not needed."
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "[iopitniopitnassetsstst01] Low Availability"
      + resource_group_name      = "io-p-itn-common-rg-01"
      + scopes                   = (known after apply)
      + severity                 = 0
      + tags                     = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT5M"

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "Availability"
          + metric_namespace       = "Microsoft.Storage/storageAccounts"
          + operator               = "LessThan"
          + skip_metric_validation = false
          + threshold              = 99.8
        }
    }

  # module.assets_locales_cdn.module.cdn_storage.azurerm_security_center_storage_defender.this[0] will be created
  + resource "azurerm_security_center_storage_defender" "this" {
      + id                                          = (known after apply)
      + malware_scanning_on_upload_cap_gb_per_month = -1
      + malware_scanning_on_upload_enabled          = false
      + override_subscription_settings_enabled      = false
      + sensitive_data_discovery_enabled            = false
      + storage_account_id                          = (known after apply)
    }

  # module.assets_locales_cdn.module.cdn_storage.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "ZRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "iopitniopitnassetsstst01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "io-p-itn-common-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "2.0.0"
          + "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.function_app_admin.module.function_admin_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Web/sites/io-p-itn-admin-func-01"
        name                                           = "io-p-itn-admin-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "3.0.0"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (34 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (11 unchanged elements hidden)
                "AzureWebJobs.CheckIoWebXmlCryptoCVESamlResponse.Disabled",
              + "AzureWebJobs.UserDataDeleteOrchestratorV2.Disabled",
              + "AzureWebJobs.UserDataProcessingTrigger.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.blob_service[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "blob_service" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01/blobServices/default|iopitnuserbackupsst01-blob-diagnostics"
        name                           = "iopitnuserbackupsst01-blob-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (5 unchanged blocks hidden)
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.queue_service[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "queue_service" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01/queueServices/default|iopitnuserbackupsst01-queue-diagnostics"
        name                           = "iopitnuserbackupsst01-queue-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (5 unchanged blocks hidden)
    }

  # module.function_app_admin.module.user_data_backups_storage_account.azurerm_monitor_diagnostic_setting.storage_account[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "storage_account" {
        id                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-admin-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnuserbackupsst01|iopitnuserbackupsst01-diagnostics"
        name                           = "iopitnuserbackupsst01-diagnostics"
        # (5 unchanged attributes hidden)

      - enabled_metric {
          - category = "Capacity" -> null
        }
      - enabled_metric {
          - category = "Transaction" -> null
        }
      + enabled_metric {
          + category = "AllMetrics"
        }

        # (2 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                                = (sensitive value)
            # (115 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01"
        name                                           = "io-p-itn-elt-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "3.0.0"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPLICATIONINSIGHTS_CONNECTION_STRING"                                                = (sensitive value)
            # (115 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Web/sites/io-p-itn-elt-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_connection_string        = (sensitive value) -> null
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_app_elt.module.function_elt_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-elt-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-elt-func-01] Health Check Failed"
        name                     = "[io-p-itn-elt-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/domains/elt/prod"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (61 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-services-rg-01/providers/Microsoft.Web/sites/io-p-itn-services-func-01"
        name                                           = "io-p-itn-services-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Platform"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "4.1.1"
            "Source"                                 = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
            "hidden-link: /app-insights-resource-id" = "[REDACTED]"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_app_services.module.function_services.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "APPINSIGHTS_INSTRUMENTATIONKEY"                  = "[REDACTED]"
            # (62 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-platform-services-rg-01/providers/Microsoft.Web/sites/io-p-itn-services-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "4.1.1"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (31 unchanged attributes hidden)

      ~ site_config {
          - application_insights_key                      = (sensitive value) -> null
            # (33 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.function_assets_cdn_itn.module.function_assets_cdn_itn.azurerm_monitor_metric_alert.function_app_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "function_app_health_check" {
      ~ enabled                  = false -> true
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-assetscdn-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-assetscdn-func-01] Health Check Failed"
        name                     = "[io-p-itn-assetscdn-func-01] Health Check Failed"
        tags                     = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "3.0.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.platform_api_gateway_apim_itn.module.platform_api_gateway.azurerm_api_management.this will be updated in-place
  ~ resource "azurerm_api_management" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.ApiManagement/service/io-p-itn-platform-api-gateway-apim-01"
        name                          = "io-p-itn-platform-api-gateway-apim-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_api_management"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "2.1.0"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (21 unchanged attributes hidden)

      ~ hostname_configuration {
          ~ proxy {
              ~ default_ssl_binding             = true -> false
                # (12 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }

        # (8 unchanged blocks hidden)
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.data.azurerm_private_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_private_dns_zone" "this" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "io-p-evt-rg"
    }

  # module.platform_service_bus_namespace_itn.module.platform_service_bus_namespace.azurerm_private_endpoint.service_bus_pep[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "service_bus_pep" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01"
        name                          = "io-p-itn-platform-sbns-pep-01"
        tags                          = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "ModuleName"     = "azure_service_bus_namespace"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "0.0.6"
            "Source"         = "https://github.com/pagopa/io-infra/blob/main/src/common/prod"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-platform-sbns-pep-01/privateDnsZoneGroups/private-dns-zone-group"
            name                 = "private-dns-zone-group"
          ~ private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.assets_locales_cdn.module.roles_svc_devs.module.storage_account.azurerm_role_assignment.blob["iopitniopitnassetsstst01|*|writer|PagoPA Storage Blob Tags Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Writer access on all the storage account for roles_svc_devs"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Blob Tags Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitniopitnassetsstst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.assets_locales_cdn.module.roles_svc_devs.module.storage_account.azurerm_role_assignment.blob["iopitniopitnassetsstst01|*|writer|Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "blob" {
      + condition_version                = (known after apply)
      + description                      = "Writer access on all the storage account for roles_svc_devs"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "300ea154-9984-4712-85e9-3abcb3e42960"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Storage/storageAccounts/iopitniopitnassetsstst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 34 to add, 15 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.function_app_elt.azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on ../_modules/function_elt/monitor.tf line 1, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
   1: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 7 more similar warnings elsewhere)
```

</details>
